In [77]:
from typing import Union
from tqdm import tqdm
from scipy.stats import shapiro
import pandas as pd
import numpy as np

from scipy import stats
from statsmodels.stats.meta_analysis import effectsize_smd
from statsmodels.stats import proportion
from statsmodels.stats.power import tt_ind_solve_power
from statsmodels.stats.power import zt_ind_solve_power

На сайте запущен А/В тест с целью увеличить доход. В приложенном excel файле вы найдете сырые данные по результатам эксперимента – user_id, тип выборки variant_name и доход принесенный пользователем revenue.
Проанализируйте результаты эксперимента и напишите свои рекомендации менеджеру.

In [78]:
df = pd.read_excel('gb_sem_8_hm.xlsx')
df.head()

C:\Users\User\AppData\Roaming\Python\Python310\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

   USER_ID VARIANT_NAME  REVENUE
0      737      variant      0.0
1     2423      control      0.0
2     9411      control      0.0
3     7311      control      0.0
4     6174      variant      0.0

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   USER_ID       10000 non-null  int64
 1   VARIANT_NAME  10000 non-null  object
 2   REVENUE       10000 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 234.5+ KB

In [80]:
df.shape

(10000, 3)

In [81]:
df.describe()

            USER_ID       REVENUE
count  10000.000000  10000.000000
mean    4981.080200      0.099447
std     2890.590115      2.318529
min        2.000000      0.000000
25%     2468.750000      0.000000
50%     4962.000000      0.000000
75%     7511.500000      0.000000
max    10000.000000    196.010000

In [82]:
df.groupby('VARIANT_NAME')['REVENUE'].describe()

               count      mean       std  min  25%  50%  75%     max
VARIANT_NAME
control       4984.0  0.129013  3.007524  0.0  0.0  0.0  0.0  196.01
variant       5016.0  0.070070  1.314802  0.0  0.0  0.0  0.0   58.63

В принципе и так уже всё понятно.

In [84]:
v = df.\
    groupby('USER_ID', as_index=False).\
    agg({'VARIANT_NAME' : pd.Series.nunique})
v.head(15)

    USER_ID  VARIANT_NAME
0         2             1
1         3             2
2         4             1
3         5             1
4         6             1
5         9             1
6        10             2
7        11             1
8        12             1
9        13             1
10       15             1
11       18             2
12       19             1
13       20             1
14       21             1

Некоторые пользователи имеются в двух группах
Убираем их

In [85]:
df.USER_ID.nunique()

6324

In [86]:
df = df.groupby(['USER_ID', 'VARIANT_NAME'], as_index=False).agg({'REVENUE': 'sum'})

In [87]:
df.shape

(7865, 3)

In [88]:
df.groupby('USER_ID', as_index=False).agg({'VARIANT_NAME': 'count'})['VARIANT_NAME'].value_counts()

1    4783
2    1541
Name: VARIANT_NAME, dtype: int64

In [89]:
unique_ids = \
(df
 .groupby('USER_ID', as_index=False)
 .agg({'VARIANT_NAME': 'count'})
 #.['VARIANT_NAME'].value_counts()
 .query('VARIANT_NAME == 1')
 .USER_ID
 .values
 )

In [90]:
df_new = df[df.USER_ID.isin(unique_ids)].copy(deep=True)

In [91]:
df_new.describe()

           USER_ID      REVENUE
count  4783.000000  4783.000000
mean   4994.395777     0.135873
std    2898.618472     3.011392
min       2.000000     0.000000
25%    2476.000000     0.000000
50%    4975.000000     0.000000
75%    7515.000000     0.000000
max    9998.000000   196.010000

In [92]:
df_new.VARIANT_NAME.value_counts()

variant    2393
control    2390
Name: VARIANT_NAME, dtype: int64

In [100]:
df_new.groupby('VARIANT_NAME')['REVENUE'].describe()

               count      mean       std  min  25%  50%  75%     max
VARIANT_NAME
control       2390.0  0.196887  4.172201  0.0  0.0  0.0  0.0  196.01
variant       2393.0  0.074935  0.858207  0.0  0.0  0.0  0.0   23.04

Вывод. Расмотрев данные по не повторяющимся пользователям. Видно что тест приносит доход намного меньше чем контрольная версия, поэтому не стоит применять тестовую версию, и оставить контрольную.